Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Please notice that the PPA is at experimental level where some performance gains are expected on drawing tasks related to rectangle copy or filling, while for image blending, even though it is operational, there are no significant gains, the initial cause for that according to the PPA section from reference manual is due to the DMA-2D memory bandwidth.
it_it: Si noti che il PPA è a livello sperimentale e sono previsti alcuni miglioramenti delle prestazioni nelle attività di disegno relative alla copia o al riempimento di rettangoli, mentre per la fusione delle immagini, sebbene operativa, non si registrano miglioramenti significativi. La causa iniziale, secondo la sezione PPA del manuale di riferimento, è dovuta alla larghezza di banda della memoria DMA-2D.

source: Please notice, some of these options needs to be enabled by setting the IDF experimental options to true:
it_it: Si noti che alcune di queste opzioni devono essere abilitate impostando le opzioni sperimentali IDF su true:

source: Please notice, when defining the :c:macro:`LV_CONF_PATH`, you need to make sure it is defined as a string, otherwise a build error will be raised.
it_it: Si noti che, quando si definisce :c:macro:`LV_CONF_PATH`, è necessario assicurarsi che sia definito come una stringa, altrimenti verrà generato un errore di compilazione.

source: Please open an issue and let us know if you see this type.
it_it: Aprire una segnalazione per farci sapere se si vede questo tipo.

source: Please refer to the ``lv_test_indev.h`` link below (in the :ref:`test_api` section) for the list of supported input device emulation functions.
it_it: Per l'elenco delle funzioni di emulazione dei dispositivi di input supportate, fare riferimento al link ``lv_test_indev.h`` qui sotto (nella sezione :ref:`test_api`).

source: Please remember that these animations can be highly resource constrained and this does not guarantee that every animation will work.
it_it: Ricordare che queste animazioni possono essere fortemente limitate nelle risorse e questo non garantisce che tutte le animazioni funzionino.

source: Please wrap the text around column 86 or narrower.
it_it: Andare a capo intorno alla colonna 86 o meno.

source: Point count (number of data points in all data series added to the chart)
it_it: Conteggio punti (numero di punti dati in tutte le serie di dati aggiunte al grafico)

source: Pointer
it_it: Puntatore

source: Pointer input devices can detect simple (up, down, left, right) and multi-touch (swipe, pinch, scroll) gestures.
it_it: I dispositivi di input puntatore possono rilevare gesti semplici (su, giù, sinistra, destra) e multi-touch ("swipe", "pinch" [pizzico], scroll).

source: Pointer input devices can have a cursor too.
it_it: Anche i dispositivi di input puntatore possono avere un cursore.

source: Pointer input devices can:
it_it: I dispositivi di input puntatore possono:

source: Pointer to a Widget (:cpp:expr:`lv_obj_t *`).
it_it: Puntatore a un Widget (:cpp:expr:`lv_obj_t *`).

source: Pointer to a screen (also :cpp:expr:`lv_obj_t *`).
it_it: Puntatore a una schermata (anche :cpp:expr:`lv_obj_t *`).

source: Pointer to an A8 or L8 image descriptor used to mask the image.
it_it: Puntatore a un descrittore di immagine A8 o L8 utilizzato per mascherare l'immagine.

source: Pointer to externally stored data to speed up rendering.
it_it: Puntatore a dati memorizzati esternamente per velocizzare il rendering.

source: Pointers which are global variables
it_it: Puntatori che sono variabili globali

source: Pointers which are static global variables
it_it: Puntatori che sono variabili globali statiche

source: Pointers which are static local variables
it_it: Puntatori che sono variabili locali statiche

source: Pop-overs currently are merely a visual effect and don't allow selecting additional characters such as accented characters yet.
it_it: Al momento, i pop-over sono solo un effetto visivo e non consentono ancora la selezione di caratteri aggiuntivi, come quelli accentati.

source: Pop-up auto-completion list
it_it: Pop-up della lista di auto-completamento

source: Popular
it_it: Popolare

source: Position
it_it: Posizione

source: Position '0' sets the cursor to the least significant digit.
it_it: La posizione '0' imposta il cursore sulla cifra meno significativa.

source: Position and Size
it_it: Posizione e Dimensione

source: Positioning
it_it: Posizionamento

source: Possible ``<type>``\ s:
it_it: Possibili ``<type>``:

source: Possible values are `LV_BIDI_DIR_LTR/RTL/AUTO`.
it_it: I valori possibili sono `LV_BIDI_DIR_LTR/RTL/AUTO`.

source: Possible values are `LV_BLEND_MODE_NORMAL/ADDITIVE/SUBTRACTIVE/MULTIPLY/DIFFERENCE`
it_it: I valori possibili sono `LV_BLEND_MODE_NORMAL/ADDITIVE/SUBTRACTIVE/MULTIPLY/DIFFERENCE`

source: Possible values are `LV_BORDER_SIDE_NONE/TOP/BOTTOM/LEFT/RIGHT/INTERNAL`.
it_it: I valori possibili sono `LV_BORDER_SIDE_NONE/TOP/BOTTOM/LEFT/RIGHT/INTERNAL`.

source: Possible values are `LV_GRAD_DIR_NONE/HOR/VER`.
it_it: I valori possibili sono `LV_GRAD_DIR_NONE/HOR/VER`.

source: Possible values are `LV_TEXT_ALIGN_LEFT/CENTER/RIGHT/AUTO`.
it_it: I valori possibili sono `LV_TEXT_ALIGN_LEFT/CENTER/RIGHT/AUTO`.

source: Possible values are `LV_TEXT_DECOR_NONE/UNDERLINE/STRIKETHROUGH`.
it_it: I valori possibili sono `LV_TEXT_DECOR_NONE/UNDERLINE/STRIKETHROUGH`.

source: Possible values are `true` or `false`.
it_it: I valori possibili sono `true` o `false`.

source: Possible values are:
it_it: I valori possibili sono:

source: Possible values are: `LV_ALIGN_DEFAULT`, `LV_ALIGN_TOP_LEFT/MID/RIGHT`, `LV_ALIGN_BOTTOM_LEFT/MID/RIGHT`, `LV_ALIGN_LEFT/RIGHT_MID`, `LV_ALIGN_CENTER`.
it_it: I valori possibili son: `LV_ALIGN_DEFAULT`, `LV_ALIGN_TOP_LEFT/MID/RIGHT`, `LV_ALIGN_BOTTOM_LEFT/MID/RIGHT`, `LV_ALIGN_LEFT/RIGHT_MID`, `LV_ALIGN_CENTER`.

source: Possible values for ``orientation`` are:
it_it: I valori possibili per ``orientation`` sono:

source: Postponed Coordinate Calculation
it_it: Calcolo Posticipato delle Coordinate

source: Potential Overhead: Continuously changing content (e.g., random colors every frame) may perform similarly to software rendering
it_it: Potenziale Overhead: I contenuti che cambiano continuamente (ad esempio, colori casuali a ogni fotogramma) possono avere prestazioni simili al rendering software.

source: Powerful building blocks such as :ref:`buttons, charts, lists, sliders, images <widgets>`, etc.
it_it: Elementi costitutivi potenti come :ref:`pulsanti, grafici, elenchi, slider, immagini <widgets>`, ecc.

source: Powerful: supports imperative programming, object-oriented programming, functional programming.
it_it: Potente: supporta la programmazione imperativa, la programmazione orientata agli oggetti e la programmazione funzionale.

source: Pre-allocated value arrays are automatically freed.
it_it: Gli array di valori pre-allocati vengono automaticamente liberati.

source: Pre-release build.
it_it: Build pre-release.

source: Precise seeking to specific positions
it_it: Ricerca precisa di posizioni specifiche

source: Prepare the workspace
it_it: Preparare l'area di lavoro

source: Prerequisites
it_it: Prerequisiti

source: Press ``Add to Project``.
it_it: Premere ``Add to Project``.

source: Press ``Generate Code`` in the top right corner.
it_it: Premere ``Generate Code`` nell'angolo in alto a destra.

source: Press ``Generate Project Content`` in the top right corner.
it_it: Premere ``Generate Project Content`` nell'angolo in alto a destra.

source: Press ctrl + shift + p.
it_it: Premere ctrl + shift + p.

source: Press the ``Add...`` button
it_it: Si preme il pulsante ``Add...``

source: Pressing the "Tab" button moves focus to the next Widget but it might be outside the visible area of the scrollable Widget.
it_it: Premendo il pulsante "Tab" si sposta il focus sul Widget successivo, ma potrebbe trovarsi al di fuori dell'area visibile del Widget scorrevole.

source: Pressing the Ctrl key also allows you to:
it_it: Premendo il tasto Ctrl è inoltre possibile:

source: Pressing the encoder's button will switch to *Edit* mode if the widget is "editable".
it_it: Premendo il pulsante dell'encoder si passa alla modalità *Edit* se il widget è "editable".

source: Preview
it_it: Anteprima

source: Preview Pane
it_it: Riquadro Anteprima

source: Preview Pane and Inspector
it_it: Pannello di "Preview" e "Inspector"

source: Preview UIs in the **LVGL UI Editor’s online preview**
it_it: Visualizzare l'anteprima delle interfacce utente nella **preview online di LVGL UI Editor**

source: Previews can be defined to preview the components in various settings in the UI Editor
it_it: È possibile definire le anteprime per visualizzare i componenti in diverse impostazioni nell'UI Editor

source: Private Repositories
it_it: Repository Privati

source: Probably you already used a product with NuttX without knowing it was running NuttX.
it_it: Probabilmente è già stato utilizzato un prodotto con NuttX senza sapere che eseguiva NuttX.

source: Problem
it_it: Problema

source: Process the logs
it_it: Elaborazione dei log

source: Process the touch data in the ``read_cb``
it_it: Elaborare i dati touch in ``read_cb``

source: Processes the XML strings and calls the required functions according to the set attributes.
it_it: Elabora le stringhe XML e richiama le funzioni richieste in base agli attributi impostati.

source: Processing gestures, like swipe, pinch, etc.
it_it: Elaborazione di gesti, come swipe, pinch, ecc.

source: Processing time increases with both source image resolution and cube map resolution
it_it: Il tempo di elaborazione aumenta sia con la risoluzione dell'immagine sorgente che con quella della mappa del cubo.

source: Products Portfolio
it_it: Portfolio Prodotti

source: Products Portfolio:
it_it: Portfolio Prodotti:

source: Programmatic viewport control with full camera manipulation
it_it: Controllo programmatico del viewport con manipolazione completa della telecamera

source: Programmatically add these buttons to a group if required.
it_it: Aggiungere questi pulsanti a un gruppo tramite codice, se necessario.

source: Programmatically open/close
it_it: Apertura/chiusura programmatica

source: Project Files Pane
it_it: Pannello "Project Files"

source: Project maintainers are responsible for clarifying the standards of acceptable behavior and are expected to take appropriate and fair corrective action in response to any instances of unacceptable behavior.
it_it: I responsabili del progetto sono tenuti a chiarire gli standard di comportamento accettabile e ad adottare misure correttive appropriate ed eque in risposta a qualsiasi caso di comportamento inaccettabile.

source: Project maintainers have the right and responsibility to remove, edit, or reject comments, commits, code, wiki edits, issues, and other contributions that are not aligned to this Code of Conduct, or to ban temporarily or permanently any contributor for other behaviors that they deem inappropriate, threatening, offensive, or harmful.
it_it: I responsabili del progetto hanno il diritto e la responsabilità di rimuovere, modificare o rifiutare commenti, commit, codice, modifiche al wiki, problemi e altri contributi che non siano in linea con questo Codice di Condotta, o di bannare temporaneamente o permanentemente qualsiasi collaboratore per altri comportamenti che ritengono inappropriati, minacciosi, offensivi o dannosi.

source: Project maintainers who do not follow or enforce the Code of Conduct in good faith may face temporary or permanent repercussions as determined by other members of the project\'s leadership.
it_it: I responsabili del progetto che non rispettano o non applicano il Codice di Condotta in buona fede potrebbero subire ripercussioni temporanee o permanenti, come stabilito dagli altri membri della dirigenza del progetto.

source: Project setup:
it_it: Setup del progetto:

source: Projects are built for it using an SDK that was generated with Yocto.
it_it: I progetti vengono creati utilizzando un SDK generato con Yocto.

source: Projects are built for them using a cross-compiler CLI toolchain SDK in a Linux PC environment (WSL, Docker, etc. can be used on Windows).
it_it: I progetti vengono sviluppati utilizzando un SDK con toolchain CLI cross-compilatore in un ambiente PC Linux (WSL, Docker, ecc. possono essere utilizzati su Windows).

source: Projects are built for them using e\ |sup2| Studio IDE, available for Windows, Mac, and Linux.
it_it: I progetti vengono creati utilizzando e\ |sup2| Studio IDE, disponibile per Windows, Mac e Linux.

source: Proper permissions to access DRM devices (e.g. running as root or adding the user to the ``video`` group).
it_it: Autorizzazioni appropriate per accedere ai dispositivi DRM (ad esempio, esecuzione come root o aggiunta dell'utente al gruppo ``video``).

source: Properties
it_it: Proprietà

source: Properties Requiring New Layers
it_it: Proprietà che Richiedono Nuovi Layer

source: Properties are the core part of describing a Widget's API.
it_it: Le proprietà sono la parte fondamentale della descrizione dell'API di un Widget.

source: Properties related to size, position, alignment and layout of Widgets.
it_it: Proprietà relative a dimensioni, posizione, allineamento e layout dei Widget.

source: Properties to describe line-like Widgets
it_it: Proprietà per descrivere i Widget lineari

source: Properties to describe spacing around a Widget.
it_it: Proprietà per descrivere la spaziatura attorno a un Widget.

source: Properties to describe spacing between the parent's sides and the children and among the children.
it_it: Proprietà che descrivono la spaziatura tra i lati del genitore e quelli dei figli e tra i figli.

source: Properties to describe the background color and image of Widget.
it_it: Proprietà per descrivere il colore di sfondo e l'immagine del Widget.

source: Properties to describe the borders
it_it: Proprietà per descrivere i bordi

source: Properties to describe the images
it_it: Proprietà per descrivere le immagini

source: Properties to describe the outline.
it_it: Proprietà per descrivere il contorno.

source: Properties to describe the properties of text.
it_it: Proprietà per descrivere le proprietà del testo.

source: Properties to describe the shadow drawn under the rectangles.
it_it: Proprietà per descrivere l'ombra disegnata sotto i rettangoli.

source: Property ID
it_it: ID Proprietà

source: Property ID Lookup by Name
it_it: Ricerca ID di Proprietà per Nome

source: Property Names
it_it: Nomi delle Proprietà

source: Property Value
it_it: Valore della Proprietà

source: Property set functions looks like this: ``lv_style_set_<property_name>(&style, <value>);`` For example:
it_it: Le funzioni per settare le proprietà sono le seguenti: ``lv_style_set_<property_name>(&style, <value>);`` Per esempio:

source: Property values can only be read from within the ``LV_EVENT_VALUE_CHANGED`` callback to ensure data validity.
it_it: I valori delle proprietà possono essere letti solo dall'interno della callback ``LV_EVENT_VALUE_CHANGED`` per garantire la validità dei dati.

source: Proprietary Formats
it_it: Formati Proprietari

source: Provide HWND-based interoperability for other Windows UI infrastructures
it_it: Offre interoperabilità basata su HWND per altre infrastrutture dell'interfaccia utente di Windows

source: Providing Links to API Pages
it_it: Fornire Link alle Pagine API

source: Providing a default value in the ``<api>``, e.g., ``<prop name="title" type="string" default="my_default_text"/>``
it_it: Specificando un valore di default in ``<api>``, ad esempio ``<prop name="title" type="string" default="my_default_text"/>``

source: Providing a second partial buffer can improve CPU utilization and increase performance compared to a single buffer if :c:macro:`LV_ST_LTDC_USE_DMA2D_FLUSH` is enabled.
it_it: Fornire un secondo buffer parziale può migliorare l'utilizzo della CPU e aumentare le prestazioni rispetto a un singolo buffer se :c:macro:`LV_ST_LTDC_USE_DMA2D_FLUSH` è abilitato.

source: Public Members
it_it: Membri Pubblici

source: Public Repositories
it_it: Repository Pubblici

source: Public or private harassment
it_it: Molestie pubbliche o private

source: Publishing others\' private information, such as a physical or
it_it: Pubblicare informazioni private altrui, come un indirizzo fisico o

source: Pull Requests
it_it: Pull Request

source: Punctual lighting support with animated light sources
it_it: Supporto illuminazione puntuale con sorgenti luminose animate

source: Pure C code (e.g., `lv_slider.c <https://github.com/lvgl/lvgl/tree/master/src/widgets/slider/lv_slider.c>`__)
it_it: Codice C puro (ad esempio, `lv_slider.c <https://github.com/lvgl/lvgl/tree/master/src/widgets/slider/lv_slider.c>`__)

source: Push the image created in the previous step to the newly created registry:
it_it: Eseguire il push dell'immagine creata nel passaggio precedente nel registry appena creato:

source: PyMSVC >= 0.4.0: Python library for using the MSVC Compiler
it_it: PyMSVC >= 0.4.0: Libreria Python per l'utilizzo del compilatore MSVC

source: Pycparser >= 2.22: Python Library for reading C preprocessor output
it_it: Pycparser >= 2.22: Libreria Python per leggere l'output del preprocessore C

source: QNX is a commercial operating system first released in 1980.
it_it: QNX è un sistema operativo commerciale rilasciato per la prima volta nel 1980.

source: QR Codes with less data are smaller, but they are scaled by an integer value to best fit to the given size.
it_it: I codici QR con meno dati sono più piccoli, ma vengono ridimensionati di un valore intero per adattarsi al meglio alle dimensioni specificate.

source: QR-Code Generator
it_it: Generatore QR-Code

source: Query model properties to understand its structure:
it_it: Interrogare le proprietà del modello per comprenderne la struttura:

source: Quick Setup
it_it: Configurazione Rapida

source: Quick start
it_it: Avvio Rapido

source: Quick-Access Panel
it_it: Pannello Quick-Access

source: RAM Cost
it_it: Costo RAM

source: RAM saving: With compile-time object construction, most of the constant objects are stored in read-only code data segments, so the RAM usage of the interpreter is very low when it starts.
it_it: Risparmio di RAM: Con la costruzione di oggetti in fase di compilazione, la maggior parte degli oggetti costanti viene memorizzata in segmenti di dati di codice di sola lettura, quindi l'utilizzo di RAM dell'interprete è molto basso all'avvio.

source: RGB, LVDS, MIPI DSI LCD Displays
it_it: Display RGB, LVDS, MIPI DSI LCD

source: RGB332 for 8-bit color depth
it_it: RGB332 per profondità di colore a 8 bit

source: RGB565 + trailing alpha byte
it_it: RGB565 + byte alfa finale

source: RGB565 Swap for 16-bit color depth (two bytes are swapped)
it_it: RGB565 Swap per profondità di colore a 16 bit (vengono scambiati due byte)

source: RGB565 big-endian format
it_it: RGB565 formato big-endian

source: RGB565 for 16-bit color depth
it_it: RGB565 per profondità di colore a 16 bit

source: RGB565 has a pixel size of 2, RGB888 has a pixel size of 3, and ARGB8888 has a pixel size of 4.
it_it: RGB565 ha una dimensione pixel di 2, RGB888 ha una dimensione pixel di 3 e ARGB8888 ha una dimensione pixel di 4.

source: RGB565 preceded by alpha byte
it_it: RGB565 preceduto da byte alfa

source: RGB565/RGB888/ARGB888/XRGB8888 + optional opacity.
it_it: RGB565/RGB888/ARGB888/XRGB8888 + opacità opzionale.

source: RGB888 for 24-bit color depth (8-bit channels without an alpha channel)
it_it: RGB888 per profondità colore a 24 bit (canali a 8 bit senza canale alfa)

source: RLE Decompression
it_it: Decompressione RLE

source: RLE compress statistics from a watch project
it_it: Statistiche di compressione RLE da un progetto di orologio

source: RPi4 custom image
it_it: Immagine personalizzata RPi4

source: RT-Thread community has port LVGL to several BSPs:
it_it: La community RT-Thread ha portato LVGL su diversi BSP [Board Support Package]:

source: RT-Thread has **Standard version** and **Nano version**.
it_it: RT-Thread è disponibile in **versione Standard** e **versione Nano**.

source: RT-Thread has high-quality scalable software architecture, loose coupling, modularity, is easy to tailor and expand.
it_it: RT-Thread ha un'architettura software scalabile di alta qualità, "loose coupling" [accoppiamento libero], modularità, è facile da personalizzare ed espandere.

source: RTL base direction changes order of the items
it_it: La direzione di base RTL modifica l'ordine degli elementi

source: RTOS Support
it_it: Supporto per RTOS

source: RTOS is required to block the LVGL drawing thread and switch to another task or suspend the CPU for power savings.
it_it: È necessario un RTOS per bloccare il thread di disegno LVGL e passare a un'altra attività o sospendere la CPU per risparmiare energia.

source: RTSP streaming for live video feeds
it_it: Streaming RTSP per feed video in diretta

source: RX72 requires an external compiler for the RXv3 core.
it_it: RX72 richiede un compilatore esterno per il core RXv3.

source: Radial
it_it: Radiale

source: Radial Gradient
it_it: Gradiente Radiale

source: Radial Gradients
it_it: Gradienti Radiali

source: Radial gradient as background
it_it: Gradiente radiale come sfondo

source: Radius and Center Offset
it_it: Raggio e Offset del Centro

source: Radius, :cpp:expr:`LV_RADIUS_CIRCLE`.
it_it: Raggio, :cpp:expr:`LV_RADIUS_CIRCLE`.

source: Read `this article <https://developer.toradex.com/torizon/application-development/working-with-containers/deploying-container-images-to-torizoncore/>`_ for more information.
it_it: Leggere `questo articolo <https://developer.toradex.com/torizon/application-development/working-with-containers/deploying-container-images-to-torizoncore/>`_ per maggiori informazioni.

source: Read from file and C array are implemented.
it_it: Sono implementate la lettura da file e l'array C.

source: Read the :ref:`contributing` guide to see how you can help to improve LVGL.
it_it: Leggere la guida per scoprire come :ref:`contributing` a migliorare LVGL.

source: Read the :ref:`font` section to learn more about symbols.
it_it: Leggere la sezione :ref:`font` per saperne di più sui simboli.

source: Read the :ref:`main_modules` pages to get a better understanding of the library.
it_it: Leggere le pagine di :ref:`main_modules` per comprendere meglio la libreria.

source: Read the Widget's documentation to learn which parts it uses.
it_it: Consultare la documentazione del Widget per scoprire quali parti utilizza.

source: Read the header comment in build.py for detailed documentation on each option.
it_it: Per una documentazione dettagliata su ciascuna opzione, leggere il commento dell'intestazione in build.py.

source: Read the mkttf docs.
it_it: Leggere la documentazione di mkttf.

source: Read this `article <https://developer.toradex.com/torizon/application-development/application-development-overview>`_ to understand how to design applications for Torizon OS.
it_it: Leggere questo `articolo <https://developer.toradex.com/torizon/application-development/application-development-overview>`_ per capire come progettare applicazioni per Torizon OS.

source: Reading Data
it_it: Lettura dei Dati

source: Reading Node Properties
it_it: Lettura delle Proprietà dei Nodi

source: Ready and Reset
it_it: Ready e Reset

source: Ready to use projects
it_it: Progetti pronti all'uso

source: Ready-to-Use Drivers
it_it: Driver Pronti all'Uso

source: Ready-to-Use Projects
it_it: Progetti Pronti-All'uso

source: Ready-to-use Projects that have NeoChrom enabled
it_it: Progetti pronti all'uso con NeoChrom abilitato
